//*****************************************************************************
//*                                                                           *
//*                      Cho sanghyun's Game Classes II                       *
//*                       Ver 8.0 / Release 2015.01.05                        *
//*                                                                           *
//*                              Object Classes                               *
//*                                                                           *
//*                                                                           *
//*                                                                           *
//*                                                                           *
//*  This Program is programmed by Cho SangHyun. sangduck@cgcii.co.kr         *
//*  Best for Game Developement and Optimized for Game Developement.          *
//*                                                                           *
//*                 ⓒ 2016 Cho Sanghyun All right reserved.                  *
//*                          http://www.CGCII.co.kr                           *
//*                                                                           *
//*****************************************************************************

#pragma once
//-----------------------------------------------------------------------------
/**

 @class		ICGDescribable
 @brief		주석을 첨가할 수 있는 속성을 가진 인터페이스 클래드
 @todo		
 @ref		
 @details	\n
 주석을 추가하고 읽을 수 있는 속성을 가지고 있는 클래스이다.
 일반적으로 객체에 대한 설명을 읽어 내어 화면 등에 출력해주거나 표시해주는 용도로
 많이 사용된다.

//

*/
//-----------------------------------------------------------------------------
class ICGDescribable : 
// ****************************************************************************
// Inherited classes)
// ----------------------------------------------------------------------------
	virtual public				ICGReferenceable
{
// ****************************************************************************
// Constructor/Destructor)
// ----------------------------------------------------------------------------
public:
	virtual	~ICGDescribable()	{}


// ****************************************************************************
// Publics) 
// ----------------------------------------------------------------------------
public:
	//! @brief 현재 객체 상태를 얻는다. @return true 현재 객체 상태
	virtual	_STRING				GetDescription() const PURE;
};
